/*1.	Выбор значений, заданных атрибутов из более, чем двух таблиц, с сортировкой – от 1 балла*/
/*Вывод Id породы, id курицы и содержание диеты*/
select "Id_породы","Id_курица","Содержание_диеты" from public."Курица",public."Диета" where "Курица"."Номер_диеты" = "Диета"."Номер_диеты" group by "Диета"."Номер_диеты", "Курица"."Id_курица";

/*2.	Использование условий WHERE, состоящих из более, чем одного условия – от 1 балла;*/
/*Вывод Номер диеты и id Птицефабрики где номер_диеты = 2 или 3 и  Id_Птицефабрики" = 1*/
select "Номер_диеты","Id_Птицефабрики" from public."Диета",public."Птицефабрика" where ("Номер_диеты" = 2 or "Номер_диеты" = 3) and "Id_Птицефабрики" = 1; 

/*3.	Использование функций для работы с датами – от 2 баллов;*/
/* Вывод разницы в днях между текущей датой и датой кормления куриц*/
select current_date - "Дата_кормления" as "Разница в днях", current_date,"Дата_кормления"  from "Кормление куриц";

/*4.	Использование строковых функций – от 3 баллов;*/
/*Вывод номера кормления и номера диеты*/
select "Номер_Кормления" || '___' || "Номер_диеты","Номер_Кормления","Номер_диеты" from "Кормление куриц";

/*5.	запрос с использованием подзапросов – от 2 баллов (многострочный подзапрос - от 3 баллов);*/
/* 
select distinct "Номер_диеты","Содержание_диеты" from public."Диета" where "Номер_диеты" in (select "Номер_диеты" from public."Диета" where "Номер_диеты" > 2);

/*6.	вычисление групповой (агрегатной) функции – от 1 балла (с несколькими таблицами – от 3 баллов);*/
Select distinct max("Номер_диеты") from public."Диета";

/*7.	вычисление групповой (агрегатной) функции с условием HAVING – от 2 баллов;*/
select max("Номер_диеты"),"Содержание_диеты" from public."Диета" group by "Номер_диеты" having max("Номер_диеты") > 2;

/*8.	использование предикатов EXISTS, ALL, SOME и ANY - от 4 баллов;*/
select distinct "Номер_диеты","Содержание_диеты" from public."Диета" where "Номер_диеты" = any (select "Номер_диеты" from public."Диета" where "Номер_диеты" != 1 and "Номер_диеты" != 4);

/*9.	использование запросов с операциями реляционной алгебры (объединение, пересечение и т.д.) - от 3 баллов;*/
select "Зарплата" from public."Работники" where "Зарплата" >= 2500;

/*10.	использование объединений запросов (inner join и т.д.) - от 3 баллов.*/
Select "Номер_диеты" from public."Диета" union select "Зарплата" from public."Работники".

