1.	Вывести всю информацию из таблицы Заселение, а так же ФИО человека, отсортировать по ФИО человека.

SELECT "Заселение"."Номер_паспорта", "Заселение"."Id_номера", "Заселение"."ФИО_администратора", "Заселение"."Дата", "Заселе-ние"."Кол-во_дней", "Человек"."ФИО_человека"
	FROM public."Заселение", public."Человек" WHERE "Заселе-ние"."Номер_паспорта" = "Человек"."Номер_паспорта" ORDER BY "Человек"."ФИО_человека";

2.	Вывести всю информацию из таблицы Заказы и Наименование продукта если "Продукты"."Количество" > "Заказ"."Количество"

SELECT "Заказ"."Номер_паспорта", "Заказ"."id_номера", "За-каз"."ФИО_администратора", "Заказ"."Время", "За-каз"."id_продукта", "Заказ"."Количество", "Продук-ты"."Наименование"
	FROM public."Заказ", public."Продукты" WHERE "Продук-ты"."Количество" > "Заказ"."Количество";

3.	Вывести всю информацию о заселениях по дате  2020-03-02.

SELECT "Номер_паспорта", "Id_номера", "ФИО_администратора", "Дата", "Кол-во_дней"
	FROM public."Заселение" WHERE "Дата" = '2020-03-02';

4.	Вывести название и длину названия всех продуктов.

SELECT "Наименование", LENGTH("Наименование") FROM "Продукты";

5.	Вывести всю информацию о заказах, если количество заказанного продукта равно 25.

SELECT * FROM "Заказ" WHERE "id_продукта" = (SELECT "id_продукта" FROM "Продукты" WHERE "Количество" = 25);

6.	Вывести все о продуктах с самым большим количеством.

SELECT * FROM "Продукты" WHERE "Количество" = (SELECT max("Количество") FROM "Продукты");

7.	Вывести всю информацию об уборщиках у которых заполнена национальность.

SELECT "ФИО_уборщика", "ФИО_Администратора", "Нацио-нальность", "Возраст" FROM public."Уборщик" GROUP BY "ФИО_уборщика", "Национальность" having "Национальность" is not null;

8.	Вывести всю информацию о номерах, если id номера совпадает с этажем.

SELECT "Id_номера", "Этаж", "Цена", "Тип" FROM public."Номер" WHERE "Id_номера" = ANY (SELECT "Этаж" FROM public."Номер");

9.	Вывод ФИО администратора, даты и кол-ва дней из таблицы засе-ление, исключая дубликаты.

SELECT DISTINCT "ФИО_администратора", "Дата", "Кол-во_дней" FROM public."Заселение";

10. Вывод всех номеров паспортов без повторений из таблиц Заселе-ние и Человек

SELECT "Номер_паспорта" FROM public."Заселение" UNION SELECT "Номер_паспорта" FROM public."Человек";

