Запрос 1. Вывести ФИО читателей, номера их телефонов, номера и название залов, в которые они записаны, отсортировать по ФИО.
select Читатели.ФИО, Читатели.Номер_телефона ,Запись_в_зал.Номер_зала, Читальные_залы.Название  
from Библиотека.Читатели, Библиотека.Запись_в_зал, Библиотека.Читальные_залы 
where Читатели.Номер_читательского_билета = Запись_в_зал.Номер_читательского_билета 
and Запись_в_зал.Номер_зала =  Читальные_залы.Номер_зала order by Читатели.ФИО

Запрос 2. Вывести номера экземпляров книг, возвращенных до истечения срока сдачи.
select Читатели.ФИО, "Взятие_книги_домой"."ID_экземпляра", 
"Взятие_книги_домой"."Дата_предполагаемого_возвращения","Взятие_книги_домой"."Дата_фактического_возвращения" 
from Библиотека.Читатели, Библиотека.Взятие_книги_домой where  "Взятие_книги_домой"."Дата_предполагаемого_возвращения" > 
"Взятие_книги_домой"."Дата_фактического_возвращения" 
and Читатели.Номер_читательского_билета = Взятие_книги_домой.Номер_читательского_билета

Запрос 3. Вывести ФИО читателей, их возраст и дату рождения.
select Читатели.ФИО, Читатели.Дата_рождения, age(Читатели.Дата_рождения)
from Библиотека.Читатели

Запрос 4. Вывести названия читальных залов в нижнем регистре.
select lower(Читальные_залы.Название) from Библиотека.Читальные_залы

Запрос 5. Вывести залы со вместимостью ниже средней.
select Читальные_залы.Название, Читальные_залы.Вместимость 
from Библиотека.Читальные_залы 
where Читальные_залы.Вместимость < 
(select  avg(Читальные_залы.Вместимость) from Библиотека.Читальные_залы)

Запрос 6. Вывести название книги с наибольшем количеством экземпляров.
SELECT Книги.Название, Книги.Число_экземпляров  
FROM "Библиотека"."Книги" 
where Книги.Число_экземпляров = (select max(Книги.Число_экземпляров) FROM "Библиотека"."Книги")

Запрос 7. Вывести ФИО посетителей, образование которых заполнено.
select Читатели.ФИО, Читатели.Образование 
from Библиотека.Читатели group by Читатели.ФИО, Читатели.Образование 
having Читатели.Образование is not null

Запрос 8. Вывести ID экземпляров, совпадающих с номерами залов за которыми они закреплены.
select "Закрепленные_книги"."ID_экземпляра" 
from Библиотека.Закрепленные_книги 
where "Закрепленные_книги"."ID_экземпляра" = 
any (select "Закрепленные_книги"."Номер_зала" from Библиотека.Закрепленные_книги)

Запрос 9. Вывести ID экземпляров, совпадающих с номерами залов за которыми они закреплены через операцию пересечения. 
select "Закрепленные_книги"."ID_экземпляра" 
from Библиотека.Закрепленные_книги 
intersect (select "Закрепленные_книги"."Номер_зала" from Библиотека.Закрепленные_книги)

Запрос 10. Вывести ID закрепленных книг, через объедененный запрос.
select "Экземпляр"."ID_книги" from Библиотека.Экземпляр 
inner join Библиотека.Закрепленные_книги  
on "Закрепленные_книги"."ID_экземпляра" = Экземпляр."ID_Экземпляра" group by "Экземпляр"."ID_книги"
