/*вывести Id, вид и дату рождения всех млекопитающих, родившихся раньше 2016 года. Использовать объединение таблиц через inner join.*/
select "Id_животного", "Вид_животного", "Дата_рождения_животного" from public."Животное" inner join "Млекопитающие" using ("Id_животного") where (select extract (year from "Дата_рождения_животного")) > 2016;

/*Вывести Id вольера, количество животных в нем и Id этого животного в тех случаях, где в вольере проживает больше одного животного. Использовать объединение таблиц и сортировку по Id вольера.*/
select distinct a."Id_вольера", a."Количество_животных_в_вольере", b."Id_животного" from public."Проживание" a inner join "Животное" b using ("Id_животного") inner join "Вольер для животного" c using ("Id_вольера") where a."Количество_животных_в_вольере" > 1 order by "Id_вольера";

/*Вывести Id всех ветеринаров и Id вылеченных ими животных со стажем больше 5 лет, которые лечили млекопитающих, родившихся позже 2016 года.*/
select distinct a."Id_работника_зоопарка", a."Стаж_работы_в_зоопарке", b."Id_животного" from public."Работник зоопарка" a inner join "Мед. осмотр" b using ("Id_работника_зоопарка") inner join "Млекопитающие" c using ("Id_животного") where a."Стаж_работы_в_зоопарке" > 5 and (select extract (year from c."Дата_рождения_млекопитающего")) > 2016;

/*Вывести всех животных женского пола, родившихся после 2015 года.*/
select * from public."Животное" a where (select extract (year from a."Дата_рождения_животного")) > 2015 and a."Пол_животного" = 'женский';

/*Вывести Id и вид животных, которых хотя бы раз кормил работник зоопарка с Id 1.*/
select a."Id_животного", a."Вид_животного" from public."Животное" a where exists (select 1 from public."Кормление" b where a."Id_животного" = b."Id_животного" and b."Id_работника_зоопарка" = 1) order by "Id_животного";

/*Вывести Id животных, лечение которых проходило ровно неделю и проводилось ветеринаром с id №2.*/
select a."Id_животного", b."Id_работника_зоопарка" from public."Лечение животных" a inner join "Работник зоопарка" b using ("Id_работника_зоопарка") where (select extract(day from a."Дата_окончания_лечения")) - (select extract(day from a."Дата_начала_лечения")) = 7 and b."Id_работника_зоопарка" = 2;

/*Вывести id зоны обитания, которая является фермой и все id животного и их виды женского пола.*/
select a."Название_зоны", b."Id_животного", b."Вид_животного" from public."Зона обитания" a inner join "Животное" b using ("Id_животного") where b."Пол_животного" = 'женский' and a."Местоположение" = 'Farm'

/*Вывести количество всех животных в летних вольерах:*/
select distinct a."Id_вольера", sum(b."Количество_животных_в_вольере") as "Количество животных" from public."Вольер для животного" a inner join "Проживание" b using ("Id_вольера") where a."Зимний_или_летний_вольер" = 'Летний' group by a."Id_вольера"

/*Вывести id, имена и виды всех млекопитающих женского пола, родившихся до 2019 года.*/
select a."Id_млекопитающего", a."Имя_млекопитающего", b."Вид_животного", b."Пол_животного" from public."Млекопитающие" a inner join "Животное" b using ("Id_животного") where b."Пол_животного" = 'женский' and (select extract (year from a."Дата_рождения_млекопитающего")) < 2019

/*Вывести id и вид всех животных, чье кормление окончилось раньше 2015 года.*/
select distinct a."Id_животного", a."Вид_животного" from public."Животное" a inner join "Кормление" b using ("Id_животного") where (select extract (year from b."Конец_кормления")) > 2015 order by "Id_животного"